# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние
# между ними в 2D пространстве.
#
# # *Пример:*
# #
# # - A (3,6); B (2,1) -> 5,09
# # - A (7,-5); B (1,-1) -> 7,21
#
#
# ax = int(input('Введите координату X точки А : '))
# ay = int(input('Введите координату Y точки А : '))
# bx = int(input('Введите координату X точки B : '))
# by = int(input('Введите координату Y точки B : '))
#
# k = bx - ax
# m = by - ay
#
# length = (round((k * k + m * m) ** 0.5), 2)
# # print(f'Длина отрезка АВ равна : {length}')

x = int(input('Введите координату X точки А : '))
y = int(input('Введите координату Y точки А : '))
d = int(input('Введите координату X точки B : '))
z = int(input('Введите координату Y точки B : '))


import math
length = round(math.sqrt((d - x)**2 + (z - y)**2), 2)

print(f'Длина отрезка АВ равна : {length}')