# Задайте список из n чисел последовательности (1+1/n)^n
# и выведите на экран их сумму.
#
# *Пример:*
#
# - Для n = 6: [2.0, 2.25, 2.37037037037037, 2.44140625, 2.4883199999999994,
# 2.5216263717421135]

#N = int(input('Введите число N: '))
#list = []
# for i in range(1, N + 1):
#     z = float((1 + (1 / i)) ** i)
#     list.append(z)
# print(list)
# print(f'сумма: {sum(list)}')

n = int(input('Введите число N: '))
list1 = [float((1 + (1 / i)) ** i) for i in range(1, n + 1)]
print(list1)
print(f'сумма: {sum(list1)}')